app/Controllers/Admin/Users.php

    public function updateUser()
    {
        $data = $this->request->getJSON(true);

        if (empty($data['id'])) {
            return $this->fail('Missing user ID', 400);
        }

        // Fetch current user
        $user = $this->model->getUserById($data['id']);
        if (!$user) {
            return $this->fail('User not found', 404);
        }

        $res = $this->model->updateUser($user['id'], $data['user'], $data['email'], $user['password_hash'], $data['user_type_id']);
---
UPDATE `users` SET `name` = 'lee', `email` = 'lee@gmail.com', `user_type_id` = '1'
WHERE `id` = '3'