app/Controllers/Admin/UserScans.php

    public function getAccuracyStats()
    {
        $db = \Config\Database::connect();

        try {
            // Get total rated scans and accurate count
            $stats = $db->table('userscan')
                ->select('COUNT(*) as total_rated, SUM(CASE WHEN is_accurate = 1 THEN 1 ELSE 0 END) as accurate_count')
                ->where('is_accurate IS NOT NULL')
                ->get()
                ->getRow();
---
SELECT COUNT(*) as total_rated, SUM(CASE WHEN is_accurate = 1 THEN 1 ELSE 0 END) as accurate_count
FROM `userscan`
WHERE `is_accurate` IS NOT NULL