app/Controllers/AuthController.php

    public function profile()
    {
        $user = getAuthenticatedUser();

        if (!$user) {
            return $this->response->setJSON([
                'status' => 'error',
                'message' => 'Not authenticated'
            ])->setStatusCode(401);
        }

        // Get full user data from database with role from usertype table
        try {
            $userData = $this->db->table('users')
                ->select('users.*, usertype.description as role')
                ->join('usertype', 'users.user_type_id = usertype.id')
                ->where('users.id', $user->id)
                ->get()
                ->getRow();
---
SELECT `users`.*, `usertype`.`description` as `role`
FROM `users`
JOIN `usertype` ON `users`.`user_type_id` = `usertype`.`id`
WHERE `users`.`id` = 1