app/Controllers/AuthController.php

    public function register()
    {
        $data = $this->request->getJSON(true);

        if (!$this->validate('register')) {
            return $this->response->setJSON([
                'status' => 'error',
                'errors' => $this->validator->getErrors()
            ])->setStatusCode(400);
        }

        // Check if email exists - use direct query instead of stored procedure
        $checkQuery = $this->db->table('users')
            ->where('email', $data['email'])
            ->countAllResults();

        if ($checkQuery > 0) {
            return $this->response->setJSON([
                'status' => 'error',
                'errors' => ['email' => 'Email already registered']
            ])->setStatusCode(400);
        }

        // Create user with stored procedure (defaults to user_type_id = 1 = student)
        $hashedPassword = password_hash($data['password'], PASSWORD_DEFAULT);

        try {
            // Insert user directly instead of using stored procedure
            $this->db->table('users')->insert([
                'name' => $data['name'],
                'email' => $data['email'],
                'password_hash' => $hashedPassword,
                'user_type_id' => 1 // student
            ]);
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `email` = 'marius.c49@yahoo.com'
INSERT INTO `users` (`name`, `email`, `password_hash`, `user_type_id`) VALUES ('Marius', 'marius.c49@yahoo.com', '$2y$10$wOkktDnaeAaYXc5a.Om.BuvrIqtnrwNmqbbTXXi.LfJQ.WSdjhJRG', 1)

            $userId = $this->db->insertID();

            // Get the user with role from usertype table
            $user = $this->db->table('users')
                ->select('users.*, usertype.description as role')
                ->join('usertype', 'users.user_type_id = usertype.id')
                ->where('users.id', $userId)
                ->get()
                ->getRow();
---
SELECT `users`.*, `usertype`.`description` as `role`
FROM `users`
JOIN `usertype` ON `users`.`user_type_id` = `usertype`.`id`
WHERE `users`.`id` = 15

    public function login()
    {
        $data = $this->request->getJSON(true);

        if (!$this->validate('login')) {
            return $this->response->setJSON([
                'status' => 'error',
                'errors' => $this->validator->getErrors()
            ])->setStatusCode(400);
        }

        // Get user directly from database with role from usertype table
        try {
            $user = $this->db->table('users')
                ->select('users.*, usertype.description as role')
                ->join('usertype', 'users.user_type_id = usertype.id')
                ->where('users.email', $data['email'])
                ->get()
                ->getRow();
---
SELECT `users`.*, `usertype`.`description` as `role`
FROM `users`
JOIN `usertype` ON `users`.`user_type_id` = `usertype`.`id`
WHERE `users`.`email` = 'robertoconnolly100@gmail.com'

    public function profile()
    {
        $user = getAuthenticatedUser();

        if (!$user) {
            return $this->response->setJSON([
                'status' => 'error',
                'message' => 'Not authenticated'
            ])->setStatusCode(401);
        }

        // Get full user data from database with role from usertype table
        try {
            $userData = $this->db->table('users')
                ->select('users.*, usertype.description as role')
                ->join('usertype', 'users.user_type_id = usertype.id')
                ->where('users.id', $user->id)
                ->get()
                ->getRow();
---
SELECT `users`.*, `usertype`.`description` as `role`
FROM `users`
JOIN `usertype` ON `users`.`user_type_id` = `usertype`.`id`
WHERE `users`.`id` = 8

    public function updateEmail()
    {
        $user = getAuthenticatedUser();

        if (!$user) {
            return $this->response->setJSON([
                'status' => 'error',
                'message' => 'Not authenticated'
            ])->setStatusCode(401);
        }

        $data = $this->request->getJSON(true);

        if (empty($data['email'])) {
            return $this->response->setJSON([
                'status' => 'error',
                'message' => 'Email is required'
            ])->setStatusCode(400);
        }

        // Validate email format
        if (!filter_var($data['email'], FILTER_VALIDATE_EMAIL)) {
            return $this->response->setJSON([
                'status' => 'error',
                'message' => 'Invalid email format'
            ])->setStatusCode(400);
        }

        // Check if email already exists (excluding current user)
        $existingEmail = $this->db->table('users')
            ->where('email', $data['email'])
            ->where('id !=', $user->id)
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `email` = 'marius.c49@gmail.com'
AND `id` != 8

        }

        try {
            $this->db->table('users')
                ->where('id', $user->id)
                ->update(['email' => $data['email']]);
---
UPDATE `users` SET `email` = 'marius.c49@gmail.com'
WHERE `id` = 8