app/Controllers/User.php

SELECT *
FROM `users`
WHERE `email` = 'sog@gmail.com'
INSERT INTO `users` (`name`, `email`, `password_hash`) VALUES ('susane', 'sog@gmail.com', '$2y$10$rdAjQYgxGDar2P1o7aq11.RiFKjtQtoig5SSTM5hVS35BtQFSwlm.')
---
    public function register()
    {
        $data = $this->request->getJSON(true);

        if (!isset($data['name'], $data['email'], $data['password'], $data['confirmPassword'])) {
            return $this->fail(['message' => 'All fields are required'], 400);
        }

        if ($data['password'] !== $data['confirmPassword']) {
            return $this->fail(['message' => 'Passwords do not match'], 400);
        }

        $exists = $this->db->table('users')->where('email', $data['email'])->get()->getRow();
        if ($exists) {
            return $this->fail(['message' => 'Email already registered'], 400);
        }

        $this->db->table('users')->insert([
            'name' => $data['name'],
            'email' => $data['email'],
            'password_hash' => password_hash($data['password'], PASSWORD_DEFAULT),
        ]);